uhnp/src/Documents/КорректировкаПланов/КорректировкаПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаПланов</name>
  <registerRecords>AccumulationRegister.ОперацииБюджетов</registerRecords>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОбъектыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПеренесено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУвеличено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.ДоговорКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечиватьПострочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПоместитьВРезерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысвобождатьРезервы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Требуется</name>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.Организация</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Требуется</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Свободно</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>Перенесено</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Увеличить</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектКонтроля</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезерв</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяРезерв</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <type>
        <types>DefinedType.ОбъектыПланирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбеспечитьЗаСчет</name>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.Организация</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектКонтроля</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьУвеличение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийКорректировкаЛимитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезерва</name>
      <type>
        <types>DefinedType.ОбъектыПланирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ПараметрыЛимитирования/ПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыЛимитирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПериодовЛимитирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРезервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольЛимитов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольРезервов</name>
    <type>
      <types>EnumRef.РежимыКонтроляДокументов</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьАналитикиСтатьиБюджетаПриКонтроле</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаПоУмолчанию</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПланированиеЗакупок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РезервированиеВПериодичностиПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/КорректировкаПланов/Forms/ВысвобождениеРезервов/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполняетсяЗакрытие Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидБюджета = Параметры.ВидБюджета;  
	ДокументРезерва = Параметры.ДокументРезерва;       

	ОбновитьЭлементыФормыНастройкиПериода();
	
	ПараметрыОП = ОперативноеПланированиеПовтИспУХ.ПолучитьПараметрыОперПланирования(ВидБюджета, Период.ДатаНачала);         
	Периодичность = ПараметрыОП.ПериодичностьЛимитирования;     

	СписокПериодичностиЛимитирования = КонтрольЛимитовУХ.ДоступныеПериодичностиЛимитирования(ВидБюджета, Период.ДатаНачала);
	Элементы.Периодичность.СписокВыбора.ЗагрузитьЗначения(СписокПериодичностиЛимитирования); 
	
	ИнициализироватьКомпоновщикНастроек();  

	ВывестиРезультатКомпоновкиДанныхВКоллекциюЗначений(); 
	
КонецПроцедуры 

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()

	СхемаКомпоновкиДанных = Документы.КорректировкаПланов.ПолучитьМакет("Резервы");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор));
	КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек); 

	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВидБюджета", 		ВидБюджета);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДатаНачала", 		Период.ДатаНачала);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДатаОкончания", 	Период.ДатаОкончания);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Документ", 		Параметры.Документ); 
	Если ДоговорыКонтрагентовВстраиваниеУХКлиентСервер.ЭтоВерсияСоглашения(Параметры.ДокументРезерва) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДокументРезерва", 	 Параметры.ДокументРезерва.ДоговорКонтрагента);
	Иначе
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДокументРезерва", 	 Параметры.ДокументРезерва);
	КонецЕсли;
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Периодичность", 	Периодичность);   
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТипыЗаявокКОбеспечению", 	КонтрольЛимитовУХ.ТипыЗаявокКОбеспечению());
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТипыЗаявокНаОперации", 	КонтрольЛимитовУХ.ТипыЗаявокНаОперации());
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТипыКорректировкиЛимитов", КонтрольЛимитовУХ.ТипыКорректировкиЛимитов());  
	    
	ВывестиБыстрыеПользовательскихНастройки();                            
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы
		И Корзина.Количество() > 0 Тогда
		
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru = 'Данные были изменены. Все изменения будут потеряны.';
									|en = 'All changes made to the data will be lost.'");  	
		Возврат;
		
	КонецЕсли;
	
	ПередЗакрытиемФормыПодбора(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент Тогда
		АдресВХранилище = АдресВХранилище(ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресВХранилище <> Неопределено Тогда
		Результат = Новый Структура;
		Результат.Вставить("АдресВХранилище", АдресВХранилище);
		ОповеститьОВыборе(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Периодичность", Периодичность);
	
	ВывестиРезультатКомпоновкиДанныхВКоллекциюЗначений();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПереносаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Периодичность) Тогда
		ДатаПереноса = ОбщегоНазначенияОПККлиентСервер.НачалоПериодаПоПериодичности(ДатаПереноса, Периодичность);
	КонецЕсли;

	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДатаПереноса",  ДатаПереноса);
	
    ВывестиРезультатКомпоновкиДанныхВКоллекциюЗначений();
	
КонецПроцедуры   

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)

	Для Каждого СтрокаТаблицы Из Корзина Цикл
		СтрокаТаблицы.Пометка = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Корзина Цикл
		СтрокаТаблицы.Пометка = Ложь;	
	КонецЦикла;      
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_БыстрыеОтборыПриИзменении(Элемент)
	
	ВывестиРезультатКомпоновкиДанныхВКоллекциюЗначений();
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере  
Процедура ВывестиРезультатКомпоновкиДанныхВКоллекциюЗначений()

	СхемаКомпоновкиДанных = Документы.КорректировкаПланов.ПолучитьМакет("Резервы");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;   

	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, 
					КомпоновщикНастроек.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	                                                                        
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;   	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Корзина.Загрузить(ТаблицаЗначений);
	
	Для Каждого СтрокаТаблицы Из Корзина Цикл      
		СтрокаТаблицы.Пометка = Истина;
		СтрокаТаблицы.НачалоПериодаСтрока = ОбщегоНазначенияОПККлиентСервер.ПредставлениеПериодаПоПериодичности(
												СтрокаТаблицы.НачалоПериода, Периодичность);	
	КонецЦикла;  
	
	ОбновитьПодвал();
	
КонецПроцедуры   

&НаСервере
Процедура ОбновитьПодвал()

	ТаблицаВалюты = Корзина.Выгрузить();   
	ТаблицаВалюты.Свернуть("Валюта", "Свободно");

	СоставПредставления = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаВалюты Цикл 
		СоставПредставления.Добавить(Формат(СтрокаТаблицы.Свободно, "ЧДЦ=0; ЧРГ=") + " " + Строка(СтрокаТаблицы.Валюта));
	КонецЦикла;
	СвободноПодвал = СтрСоединить(СоставПредставления, ", ");

КонецПроцедуры

&НаСервере
Процедура ВывестиБыстрыеПользовательскихНастройки()
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	КоличествоОтборов = Настройки.Отбор.Элементы.Количество();

	ПолеОтборы = Элементы.Добавить("ПолеОтборы", Тип("ГруппаФормы"), 
					Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки);
	ПолеОтборы.Вид  = ВидГруппыФормы.ОбычнаяГруппа;
	ПолеОтборы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ПолеОтборы.ОтображатьЗаголовок = Ложь;
	
	ОтборыКолонкаВлево   = Элементы.Добавить("ОтборыКолонка1", Тип("ГруппаФормы"), ПолеОтборы);
	ОтборыКолонкаВлево.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ОтборыКолонкаВлево.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ОтборыКолонкаВлево.ОтображатьЗаголовок  = Ложь;
	ОтборыКолонкаВлево.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	
	ОтборыКолонкаВправо  = Элементы.Добавить("ОтборыКолонка2", Тип("ГруппаФормы"), ПолеОтборы);
	ОтборыКолонкаВправо.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ОтборыКолонкаВправо.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ОтборыКолонкаВправо.ОтображатьЗаголовок = Ложь;
	ОтборыКолонкаВправо.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	
	НастроекНаКолонку = Окр(КоличествоОтборов / 2, 0, РежимОкругления.Окр15как20);
	Колонка = ОтборыКолонкаВлево;
	
	НомерЭлемента = 0;
	Для каждого ЭлОтбора Из Настройки.Отбор.Элементы Цикл
		
		Если НомерЭлемента = НастроекНаКолонку Тогда
			Колонка = ОтборыКолонкаВправо;
		КонецЕсли;

		ПолеГруппыОтбора = Элементы.Добавить("КомпоновщикНастроекПользовательскиеНастройкиЭлемент" 
							+ НомерЭлемента, Тип("ГруппаФормы"), Колонка);
		ПолеГруппыОтбора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ПолеГруппыОтбора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ПолеГруппыОтбора.ОтображатьЗаголовок = Ложь;
		ПолеГруппыОтбора.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;

		ПолеИспользование = Элементы.Добавить("КомпоновщикНастроекПользовательскиеНастройкиЭлемент" 
							+ НомерЭлемента + "Использование", Тип("ПолеФормы"), ПолеГруппыОтбора);
		ПолеИспользование.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеИспользование.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		ПолеИспользование.Заголовок = ЭлОтбора.ЛевоеЗначение;
		ПолеИспользование.ПутьКДанным = "КомпоновщикНастроек.ПользовательскиеНастройки[" + НомерЭлемента + "].Использование";    
		ПолеИспользование.УстановитьДействие("ПриИзменении", "Подключаемый_БыстрыеОтборыПриИзменении");
		
		ПолеВидСравнения = Элементы.Добавить("КомпоновщикНастроекПользовательскиеНастройкиЭлемент" 
							+ НомерЭлемента + "ВидСравненияЭлементаОтбора", Тип("ПолеФормы"), ПолеГруппыОтбора);
		ПолеВидСравнения.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВидСравнения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеВидСравнения.РастягиватьПоГоризонтали = Ложь;
		ПолеВидСравнения.ПутьКДанным = "КомпоновщикНастроек.ПользовательскиеНастройки[" + НомерЭлемента + "].ВидСравнения"; 
		ПолеВидСравнения.УстановитьДействие("ПриИзменении", "Подключаемый_БыстрыеОтборыПриИзменении");

		ПолеЗначение = Элементы.Добавить("КомпоновщикНастроекПользовательскиеНастройкиЭлемент" 
						+ НомерЭлемента + "Значение", Тип("ПолеФормы"), ПолеГруппыОтбора);
		ПолеЗначение.Вид = ВидПоляФормы.ПолеВвода;
		ПолеЗначение.ВыбиратьТип = Ложь;
		ПолеЗначение.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПолеЗначение.ПутьКДанным = "КомпоновщикНастроек.ПользовательскиеНастройки[" + НомерЭлемента + "].Значение";
		ПолеЗначение.УстановитьДействие("ПриИзменении", "Подключаемый_БыстрыеОтборыПриИзменении");
		
		НомерЭлемента = НомерЭлемента + 1;  
		
	КонецЦикла;    
	
КонецПроцедуры

&НаСервере
Функция АдресВХранилище(УникальныйИдентификаторВладельца)
	
	АдресВХранилище = Неопределено;
	
	Если ПеренестиВДокумент Тогда
		
		ПараметрыОтбора = Новый Структура("Пометка", Истина);
		ВыбранныеЭлементы = Корзина.НайтиСтроки(ПараметрыОтбора);

		АдресВХранилище = ПоместитьВоВременноеХранилище(ВыбранныеЭлементы, УникальныйИдентификаторВладельца);
		
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемФормыПодбора(Форма, Отказ)
	
	Если Форма.ПеренестиВДокумент ИЛИ Форма.ВыполняетсяЗакрытие Тогда
		Возврат;
	КонецЕсли;
	
	Если Корзина.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина; 
	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемФормыПодбораЛимитовЗавершение", 
						ЭтотОбъект,	Новый Структура("Форма", Форма));
						
	ТекстВопроса = НСтр("ru = 'Подобранные лимиты не перенесены в документ. Перенести?'");						
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемФормыПодбораЛимитовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Форма.ПеренестиВДокумент = Истина;
		Форма.ВыполняетсяЗакрытие = Истина;
		Форма.Закрыть(КодВозвратаДиалога.OK);
		Форма.ВыполняетсяЗакрытие = Ложь;
		Возврат;
	КонецЕсли;
	
	Форма.ВыполняетсяЗакрытие = Истина;
	Форма.Закрыть();
	Форма.ВыполняетсяЗакрытие = Ложь;

КонецПроцедуры

&НаСервере    
Процедура ОбновитьЭлементыФормыНастройкиПериода()
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		
		Запрос = Новый Запрос;  
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПараметрыЛимитирования.Период КАК Период
		|ИЗ
		|	РегистрСведений.ПараметрыЛимитирования КАК ПараметрыЛимитирования
		|ГДЕ
		|	ПараметрыЛимитирования.Период <= &Период
		|	И ПараметрыЛимитирования.ВидБюджета = &ВидБюджета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";  
		Запрос.УстановитьПараметр("Период", 	Параметры.ДатаДокумента); 
		Запрос.УстановитьПараметр("ВидБюджета", ВидБюджета);
        	
		РезультатЗапроса = Запрос.Выполнить();
		ПериодыЛимитирования = РезультатЗапроса.Выбрать();   
		
		Если ПериодыЛимитирования.Следующий() Тогда  
			
			Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
			Период.ДатаНачала = ПериодыЛимитирования.Период;		
			
			ПараметрыЛимитирования = КонтрольУХВызовСервера.ПараметрыЛимитированияПериода(ВидБюджета, Период.ДатаНачала, 1);   
			Если ПараметрыЛимитирования = Неопределено Тогда
				Период.ДатаОкончания = Дата('3999.12.31 23:59:59');
			Иначе
				Период.ДатаОкончания = ПараметрыЛимитирования.Период - 1;	
			КонецЕсли;
			
		КонецЕсли;    
		
	КонецЕсли;  

КонецПроцедуры
																	
&НаСервереБезКонтекста
Функция ПолучитьПараметрыФормыЗаписиПараметровЛимитирования(Период, ВидБюджета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидБюджета", ВидБюджета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыЛимитирования.ВидБюджета КАК ВидБюджета
	|ИЗ
	|	РегистрСведений.ПараметрыЛимитирования КАК ПараметрыЛимитирования
	|ГДЕ
	|	ПараметрыЛимитирования.Период = &Период
	|	И ПараметрыЛимитирования.ВидБюджета = &ВидБюджета";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Возврат Новый Структура("Ключ", ПолучитьКлючЗаписиПараметровЛимитирования(Период, ВидБюджета));
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ИСТИНА КАК Использовать,
	|	ПараметрыЛимитированияСрезПоследних.ВидБюджета КАК ВидБюджета,
	|	ПараметрыЛимитированияСрезПоследних.ПериодичностьЛимитирования КАК ПериодичностьЛимитирования,
	|	ПараметрыЛимитированияСрезПоследних.КоличествоПериодовЛимитирования КАК КоличествоПериодовЛимитирования,
	|	ПараметрыЛимитированияСрезПоследних.ИспользоватьЛимитирование КАК ИспользоватьЛимитирование,
	|	ПараметрыЛимитированияСрезПоследних.ИспользоватьРезервирование КАК ИспользоватьРезервирование,
	|	ПараметрыЛимитированияСрезПоследних.СпособОпределенияВалютыЛимитирования КАК СпособОпределенияВалютыЛимитирования,
	|	ПараметрыЛимитированияСрезПоследних.КонтрольЛимитов КАК КонтрольЛимитов,
	|	ПараметрыЛимитированияСрезПоследних.КонтрольРезервов КАК КонтрольРезервов
	|ИЗ
	|	РегистрСведений.ПараметрыЛимитирования.СрезПоследних(&Период, ВидБюджета = &ВидБюджета) КАК ПараметрыЛимитированияСрезПоследних";	
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	Для Каждого Колонка Из Результат.Колонки Цикл
		ЗначенияЗаполнения.Вставить(Колонка.Имя);
	КонецЦикла;
	ЗначенияЗаполнения.Период = Период;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Выборка);
	
	Возврат Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
КонецФункции   

&НаСервереБезКонтекста
Функция ПолучитьКлючЗаписиПараметровЛимитирования(Период, ВидБюджета)
	
	ДанныеКлюча = Новый Структура("Период, ВидБюджета", Период, ВидБюджета);
	КлючЗаписи = РегистрыСведений.ПараметрыЛимитирования.СоздатьКлючЗаписи(ДанныеКлюча);

	Возврат КлючЗаписи;
	
КонецФункции

&НаКлиенте
Процедура КорзинаПриИзменении(Элемент)
	
	ОбновитьПодвал();
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ВыполняетсяЗакрытие = Ложь;

#КонецОбласти
